x = 4.44444

y <- 2
class(y)

z = "Helloworld|"

base = x / y
print(round(base, 2))

if (x!=y) { print("True")
} else {
  print("False")
}

cat(z, z, z)
  
for (i in 1:2) {
  print("Маркетинговый проект запустился в 2021 году")
  print("Маркетинговый проект запустился в 2022 году")
  print("Маркетинговый проект запустился в 2023 году")
}

if (x==y) { for (i in 1:2)
  print("Маркетинговый проект запустился в 2021 году")
  print("Маркетинговый проект запустился в 2022 году")
  print("Маркетинговый проект запустился в 2023 году")
} else {
  print("Маркетинговый проект будет запущен в 2024 году")
  print("Маркетинговый проект будет запущен в 2025 году")
  print("Маркетинговый проект будет запущен в 2026 году")
  print("Маркетинговый проект будет запущен в 2027 году")
  print("Маркетинговый проект будет запущен в 2028 году")
  print("Маркетинговый проект будет запущен в 2029 году")
  print("Маркетинговый проект будет запущен в 2030 году")
}

